#include "alg1.cpp"
#include <cassert>


// Проверка функции на возрастание
void test1() {

	// Задаём переменные
	int n = 4;
	float min = -10;
	float max = 10;

	// Создаём массив
	double *a = new double[n];

	a = RandMasUp(n, min, max);	// Получаем массив

	for (int i = 1; i < n; ++i)
	{
		assert(a[i-1] < a[i]);  // Если текущее значение меньше предыдущего, программа продолжается
	}
	
	const int m1 = 17;
	const int m2 = 10;
	const int m3 = 5;

	// Массивы для проверки функции поиска значения
	double b1[m1] = {-32.864, 21.333, -21.333, 3, 8, -21.332, -12.129, -9.999, -7, -5, -3, -19.1, -19.0, -2, 1, 22, 23};
	double b2[m2] = {-19.0, -12.129, -9.999, 21.332, 21.334, 21.333, -19.1, 1, 3, 23};
	double b3[m3] = {-10, -10.1, 10.1, -10.11, 10.11};

	// Проверка работы функции поиска значения
	int s = SearchMas(17, b1, -21.333);
	assert(3 == s);	// Если найденное значение равно предусмотренному, программа продолжается
	s = SearchMas(10, b2, 21.334);
	assert(5 == s);
	s = SearchMas(5, b3, 10.11);
	assert(5 == s);
	
	// Проверка при несуществующем значении
	s = SearchMas(5, b3, 10.0);
	assert(0 == s);

	// Массивы для проверки функции бинарного поиска
	double с1[m1] = {-32.864, -21.333, -21.332, -19.1, -19.0, -12.129, -9.999, -7, -5, -3, -2, 1, 3, 8, 21.333, 22, 23};
	double c2[m2] = {-19.1, -19.0, -12.129, -9.999, 1, 3, 21.332, 21.333, 21.334, 23};
	double c3[m3] = {-10.11, -10.1, -10, 10.1, 10.11};

	// Проверка работы функции бинарного поиска значения
	s = SearchMasBi(17, с1, -21.333);
	assert(2 == s);	// Если найденное значение равно предусмотренному, программа продолжается
	s = SearchMasBi(10, c2, 21.333);
	assert(8 == s);
	s = SearchMasBi(5, c3, -10.0);
	assert(3 == s);

	// Проверка при несуществующем значении
	s = SearchMasBi(5, c3, 10.0);
	assert(0 == s);


	cout << "Тест окончен. Ошибок нет." << endl;
}